app/Controllers/Home.php

UPDATE "deportes" SET "id" = '1', "asunto" = 'Muerte de Luis Suárez Miramontes, leyenda del fútbol y primer Balón de Oro español', "informacion" = 'Luis Suárez, leyenda del fútbol español, falleció a los 88 años en Milán. Ganó el Balón de Oro en 1960 y jugó en el Inter de Milán. Su talento inspiró a generaciones..', "fecha" = '2023-07-09', "origen" = 'Infobae', "url" = 'https://www.infobae.com/espana/2023/07/09/muere-luis-suarez-miramontes-leyenda-del-futbol-espanol-al-que-dio-su-unico-balon-de-oro/'
WHERE "id" = '1'
---
    public function actualizarDato($id)
    {
        $data = $this->request->getJSON(true);

        $db = \Config\Database::connect();
        $db->table('deportes')->set($data)->where('id', $id)->update();

DELETE FROM "deportes"
WHERE "id" = '1'
---
 public function borrardatos($id)
 {
     $db = \Config\Database::connect();

     // Eliminar el dato segun el ID
     $db->table('deportes')->where('id', $id)->delete();

INSERT INTO "deportes" ("id", "asunto", "informacion", "fecha", "origen", "url") VALUES ('1', 'Muerte de Luis Suárez Miramontes, leyenda del fútbol y primer Balón de Oro español', 'Luis Suárez, leyenda del fútbol español, falleció a los 88 años en Milán. Ganó el Balón de Oro en 1960 y jugó en el Inter de Milán. Su talento inspiró a generaciones..', '2023-07-09', 'Infobae', 'https://www.infobae.com/espana/2023/07/09/muere-luis-suarez-miramontes-leyenda-del-futbol-espanol-al-que-dio-su-unico-balon-de-oro/')
---
 public function agregar_un_dato()
 {
     $data = $this->request->getJSON(true);


     $db = \Config\Database::connect();
     $db->table('deportes')->set($data)->insert();